# Задание 1

Скачайте с сайта grouplens.org...movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [2]:
import pandas as pd

In [55]:
movies = pd.read_csv('/Users/zorinapancenko/Desktop/ml-25m/movies.csv')

In [47]:
ratings = pd.read_csv('/Users/zorinapancenko/Desktop/ml-25m/ratings.csv')

In [73]:
joined = movies.merge(ratings, on='movieId', how='left')
joined_f = joined[['movieId', 'title', 'rating']]
joined_f.head()

   movieId             title  rating
0        1  Toy Story (1995)     3.5
1        1  Toy Story (1995)     4.0
2        1  Toy Story (1995)     3.0
3        1  Toy Story (1995)     4.0
4        1  Toy Story (1995)     4.0

In [80]:
joined_f[joined_f['rating'] == 5.0]['title'].value_counts().head()

Shawshank Redemption, The (1994)             39553
Pulp Fiction (1994)                          32169
Forrest Gump (1994)                          25918
Star Wars: Episode IV - A New Hope (1977)    25804
Matrix, The (1999)                           25482
Name: title, dtype: int64

### Ответ: Shawshank Redemption (1994)

# Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [90]:
data = pd.read_csv('/Users/zorinapancenko/Desktop/python/10._Основы_pandas/power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [97]:
data_f = data[ ((data['country'] == 'Estonia') | (data['country'] == 'Lithuania') | (data['country'] == 'Latvia')) & ((data['category'] == 4) | (data['category'] == 12) | (data['category'] == 21)) & (data['year'] >= 2005) & (data['year'] <= 2010) & (data['quantity'] > 0)  ]
data_f

          country  year  quantity  category
10617     Estonia  2008       1.0         4
10620     Estonia  2005       1.0         4
11156   Lithuania  2008       1.0         4
11158   Lithuania  2006       1.0         4
11159   Lithuania  2005       1.0         4
...           ...   ...       ...       ...
253982  Lithuania  2009      98.0        21
253983  Lithuania  2008      54.0        21
253984  Lithuania  2007      47.0        21
253985  Lithuania  2006      31.0        21
253986  Lithuania  2005       1.0        21

[347 rows x 4 columns]

In [101]:
res = data_f['quantity'].sum()
res

240580.0

### Ответ: 240580.0

# Задание 3

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [17]:
tables = pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', encoding='utf-8')[0]
tables.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,ММВБ,3 735,"-0,5%",Nasdaq,14 837,"1,0%",Биткойн,38 110,"8,0%",USD/RUB,737881,"0,1%"
1,РТС,1 596,"-0,2%",S&P500,4 412,"1,0%",Нефть,738,"-0,6%",EUR/RUB,867925,"0,0%"
2,Dow,35 062,"0,7%",FTSE100,7 028,"0,9%",Золото,1 807,"0,2%",EUR/USD,11774,"0,0%"

In [19]:
tables_1 = pd.read_html('https://fortrader.org/quotes', encoding='utf-8')[1]
tables_1.head(10)

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Нефть Brent Курс нефти сегодня,73.90,-0.51,-0.69,NaN
1,Нефть WTI Цены на нефть WTI,72.16,-0.17,-0.24,NaN
2,Природный газ Цена на природный газ,4.09,0.07,1.67,NaN
3,Кофе,207.95,16.20,8.45,NaN
4,Кукуруза,549.40,2.40,0.44,NaN
5,Соя,350.70,-2.20,-0.62,NaN
6,Хлопок,89.60,-0.06,-0.07,NaN